biddr_api/app/controllers/auctions_controller.rb

    def show
        # auction = Auction.find params[:id]
        # render json: auction
        #experiment :
        auction = Auction.find params[:id]
        bids = Bid.where auction_id: auction.id
---
SELECT  "auctions".* FROM "auctions" WHERE "auctions"."id" = $1 LIMIT $2  [["id", 44], ["LIMIT", 1]]
SELECT  "bids".* FROM "bids" WHERE "bids"."auction_id" = $1 LIMIT $2  [["auction_id", 44], ["LIMIT", 1]]

    def index

        auctions = Auction.order(created_at: :desc)
---
SELECT "auctions".* FROM "auctions" ORDER BY "auctions"."created_at" DESC

    def create
        auction = Auction.new auction_params

        auction.save!
---
INSERT INTO "auctions" ("title", "details", "r_price", "ending_date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"